tap "aws/tap"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/bundle"
tap "homebrew/core"
tap "mapbox/cli"
tap "pothosware/pothos"
tap "tylerbrock/saw"
tap "wallix/awless"
tap "dkanejs/aws-session-manager-plugin"

# is required for java-based brews, like ant
cask "java"

# set up common deps first
brew "python"
brew "python@2"
brew "php"

brew "awless"
brew "aws-sam-cli"
brew "aws-session-manager-plugin"
brew "awscli"
brew "azure-cli"
brew "bash-completion"
brew "bash"
brew "colordiff"
brew "coreutils"
brew "direnv"
brew "dos2unix"
brew "ffmpeg"
brew "findutils"
brew "gawk"
brew "gawk"
brew "git-flow"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-which"
brew "gnupg"
brew "go"
brew "godep"
brew "graphviz"
brew "grep"
brew "highlight"
brew "htop"
brew "jo"
brew "jq"
brew "libgit2"
brew "libxml2"
brew "lz4"
brew "lzo"
brew "mas"
brew "mc"
brew "mpfr"
brew "mpv"
brew "mtr"
brew "nasm"
brew "node"
brew "oath-toolkit"
brew "packer"
brew "pandoc"
brew "pigz"
brew "pinentry-mac"
brew "pkcs11-helper"
brew "pstree"
brew "rsync"
brew "ruby"
brew "saw"
brew "shellcheck"
brew "siege"
brew "sift"
brew "telnet"
brew "terraform"
brew "tmux"
brew "transcrypt"
brew "tree"
brew "unixodbc"
brew "watch"
brew "wget"
brew "wrk"
brew "yarn"
brew "youtube-dl"
brew "yq"

cask "alfred"
cask "android-platform-tools"
cask "bitbar"
cask "calibre"
cask "ccmenu"
cask "docker"
cask "dropbox"
cask "enpass"
cask "evernote"
cask "franz"
cask "google-chrome"
cask "google-cloud-sdk"
cask "hex-fiend"
cask "insomnia"
cask "iterm2"
cask "keepassx"
cask "keybase"
cask "microsoft-remote-desktop-beta"
cask "openemu"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlrest"
cask "qlstephen"
cask "qlvideo"
cask "quickgeojson"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklook-pfm"
cask "sequel-pro"
cask "skype"
cask "slack"
cask "sourcetree"
cask "spectacle"
cask "spotifree"
cask "spotify"
cask "tunnelblick"
cask "virtualbox"
cask "visual-studio-code"
cask "zoomus"

mas "DrCleaner", id: 921458519
