tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "romkatv/gitstatus"
tap "samtay/tui"
tap "teamookla/speedtest"

brew "asdf"
brew "awscli"
brew "bash-completion@2"
brew "bash"
brew "colordiff"
brew "coreutils"
brew "curl"
brew "direnv"
brew "dive"
brew "dos2unix"
brew "ffmpeg"
brew "findutils"
brew "fzf"
brew "gawk"
brew "gh"
brew "gifsicle"
brew "git-bug"
brew "git-cliff"
brew "git-delta"
brew "git-gui"
brew "git-open"
brew "git-standup"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-which"
brew "gnupg"
brew "gnutls"
brew "graphviz"
brew "grep"
brew "htop"
brew "jq"
brew "make"
brew "mc"
brew "mdcat"
brew "mtr"
brew "oath-toolkit"
brew "pipx"
brew "pstree"
brew "python@3.11"
brew "romkatv/gitstatus/gitstatus"
brew "rsync"
brew "samtay/tui/tetris"
brew "shellcheck"
brew "teamookla/speedtest/speedtest"
brew "telnet"
brew "tree"
brew "watch"
brew "wget"
brew "youtube-dl"
brew "yq"

cask_args no_quarantine: true

cask "alfred"
cask "apparency"
cask "boop"
cask "drawio"
cask "dropbox"
cask "enpass"
cask "firefox"
cask "franz"
cask "hex-fiend"
cask "ipynb-quicklook"
cask "iterm2"
cask "keepassxc"
cask "mattermost"
cask "microsoft-teams"
cask "microsoft-auto-update"
cask "mpv"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "free-ruler"
cask "quickgeojson"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklook-pfm"
cask "rancher"
cask "rectangle"
cask "sequel-ace"
cask "session-manager-plugin"
cask "spotify"
cask "syntax-highlight"
cask "topnotch"
cask "visual-studio-code"
cask "vivaldi"
cask "webpquicklook"
cask "zoom"

vscode "EditorConfig.EditorConfig"
vscode "github.vscode-github-actions"
vscode "hashicorp.terraform"
vscode "mkhl.shfmt"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.makefile-tools"
vscode "nguyenngoclong.asdf"
